{
  "key": [
    {
      "id": "",
      "title": "",
      "day": "",
      "time": "",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": "",
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    }
  ],
  "event": [
    {
      "id": "101",
      "title": "Breakfast",
      "day": "tues",
      "time": "8:00 am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "102",
      "title": "Morning Session",
      "day": "tues",
      "time": "9:00 am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "103",
      "title": "Morning Session",
      "day": "tues",
      "time": "10:00 am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "104",
      "title": "Lunch",
      "day": "tues",
      "time": "11:00 am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "105",
      "title": "Welcome & introductions",
      "day": "tues",
      "time": "12:00 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "Youa",
          "lName": "Yang",
          "photo": "https://www.barlowresearch.com/BusinessBankingConference_2025/images/presenters/YouaYang.png",
          "company": "Barlow Research",
          "title": "Managing Partner and COO",
          "bio": "Youa is a Managing Partner and Chief Operating Officer at Barlow Research. She provides leadership and general day-to-day management to the company’s teams. She is also responsible for leading, guiding and executing on the company’s vision and ensuring alignment with Barlow’s goals. With more than 20 years of market research experience, Youa aims to foster a growth-oriented and positive environment to continue Barlow’s gold standard in business banking research. Youa holds a B.A. from the University of Minnesota-Duluth and attended the University of Wisconsin, Stout. In her spare time, she enjoys spending time with her family and friends and traveling the world."
        }
      ]
    },
    {
      "id": "106",
      "title": "Keynote - Breaking Down Silos: Adapting to the Future of Banking",
      "day": "tues",
      "time": "12:15pm",
      "description": "In an era marked by advanced technologies, heightened competition, and shifting workplace dynamics, the future of banking requires a new approach. Join Pradip Patiath, Senior Partner with McKinsey & Co, as he explores the critical challenges facing large financial institutions over the next decade. Discover how breaking out of functional silos and adopting a holistic understanding of your role can help your bank thrive in a rapidly evolving social and economic landscape.",
      "assets": "",
      "speakers": [
        {
          "fName": "Pradip",
          "lName": "Patiath",
          "photo": "https://www.barlowresearch.com/BusinessBankingConference_2025/images/presenters/Pradip-Patiath.png",
          "company": "McKinsey & Company",
          "title": "Senior Partner",
          "bio": "Pradip Patiath is a Senior Partner at McKinsey & Company and senior global leader in McKinsey’s Financial Services and Digital practices. Over the years, he has led several of McKinsey’s global practices, including Consumer/Business Banking, Digital Insurance, and Midwest Financial Services. He has also been the Managing Partner of the Digital McKinsey office in the Midwest and Canada.<br/><br/>Over the past two decades, Mr. Patiath has served clients in the banking, wealth management, insurance, private equity, asset management, payments and FinTech sectors on issues of strategy, growth, organization, turnarounds, M&A, distribution, operations and digital transformation, and has personally led a number of business builds and major performance transformations. His experience has spanned North America and several international markets across the U.K., Europe, South America and Asia. He has authored several leading publications, most recently on the topic of disruption and rapid digitization within financial services. He is a frequent public speaker and commentator at major global financial services and technology industry conferences.<br/><br/>Mr. Patiath’s prior experience has included building an enterprise software company in the digital insurance sector as President and COO of CCC Information Services. Previously, he also worked for Honeywell, Inc. in Minneapolis, MN, and for Schlumberger in Paris, France. He was awarded a US patent in the field of real-time digital transaction systems. Mr. Patiath is very active in Chicago’s civic community. He recently served as the Chair of the Board of the Adler Planetarium of Chicago, and serves on several other Boards, including Northwestern University’s Kellogg School Global Advisory Board and the Chicago Humanities Festival. He is also a member of the Economic Club of Chicago and is actively involved with and supports several civic institutions, including Marwen, American India Foundation, the Field Museum and the Art Institute of Chicago.<br/><br/>Mr. Patiath holds an MBA degree with distinction from Northwestern University’s Kellogg School of Management. He also holds an MS degree in computer science and received his BS degree in mechanical engineering from Indian Institute of Technology, New Delhi."
        }
      ]
    },
    {
      "id": "107",
      "title": "Session",
      "time": "1:05 pm",
      "day": "tues",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": "",
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "108",
      "title": "MMB Panel",
      "day": "tues",
      "time": "1:35 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "109",
      "title": "Session",
      "day": "tues",
      "time": "2:10pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "name": "",
          "fName": "",
          "lName": "",
          "photo": null,
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "110",
      "title": "Innovation Showcase Break",
      "day": "tues",
      "time": "2:45 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "name": "",
          "fName": "",
          "lName": "",
          "photo": null,
          "company": "",
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "111",
      "title": "Session",
      "day": "tues",
      "time": "3:05 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "112",
      "title": "DBB Panel",
      "day": "tues",
      "time": "3:40 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "113",
      "title": "Panel",
      "day": "tues",
      "time": "4:15 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "114",
      "title": "Wine Reception",
      "day": "tues",
      "time": "5:00 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "115",
      "title": "Evening free",
      "day": "tues",
      "time": "6:00 pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "116",
      "title": "Greeting",
      "day": "wed",
      "time": "8:00am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "117",
      "title": "Keynote - Why Purpose Matters",
      "day": "wed",
      "time": "8:15am",
      "description": "Banking is built on numbers and risk management, but Amanda Brinkman makes a bold case: purpose is the key to lasting success.This isn’t just another talk about passion - it’s a strategic advantage. Amanda challenges the idea that success is purely financial, showing how purpose-driven professionals build stronger client relationships, drive innovation, and achieve better results. Through engaging stories and real-world examples, she reveals how aligning work with a deeper mission creates impact and long-term value. Attendees will leave with a fresh perspective and practical takeaways to see purpose in their work and lives.",
      "assets": "",
      "speakers": [
        {
          "fName": "Amanda",
          "lName": "Brinkman",
          "photo": "https://www.barlowresearch.com/BusinessBankingConference_2025/images/presenters/Amanda-Brinkman.png",
          "title": "Keynote Speaker + CEO ",
          "company": "Sunshine Studios",
          "bio": "Amanda is a producer, film-maker, branding expert and sought-after public speaker, sharing her 'Do Well By Doing Good” philosophy on stages around the country. She demonstrates how both companies and individuals can make a meaningful and positive difference in people’s lives, while fostering their own success in the process. She believes that companies must not only identify their brand purpose, but put that purpose into action.<br /><br />Through her work, Amanda has defined what it looks like for brands to truly act 'as publishers” creating movements through their content strategy. In her most recent demonstration of this, Amanda was the Chief Brand Officer of Deluxe where the brand challenge was to reach small businesses. The solution? She created, produced and hosted their Emmy-nominated series 'Small Business Revolution,” which streamed on Hulu and was named among Inc. Magazine’s top shows for entrepreneurs. Through this inspirational reality show, Amanda was able to prove the model of authentic content stretching a brand’s spend by achieving 12x the reach through this series over traditional paid media. The program accumulated over 13 Billion impressions, 6,000+ earned media articles and 20 million content views (and counting). Not to mention - this work changed lives, families, small businesses and communities across the country.<br /><br />Amanda is a nationally renowned brand expert, Forbes contributor, and frequent on-camera personality for national news outlets and celebrity interviews, ranging from LL Cool J to Peyton Manning. She has appeared on CNBC’s 'Cleveland Hustles,” in addition to hosting the online 'Small Talks” series that features successful entrepreneurs across the country. That’s all while charting an acclaimed career that spans groundbreaking campaigns for brands like BMW, Reebok and Sony, in addition to her role as an inspiring female executive at Fortune 500 and Fortune 1000 companies, such as United Health Group, Allianz, General Mills, and Deluxe. Amanda’s current and former board service includes the Children’s Cancer Research Fund, Make-A-Wish, the Children’s Theatre Company, the Ordway Performing Arts Center, Ad Council, ANA (Association of National Advertisers) and the Women’s Business Development Center. She also passionately volunteers for causes such as Special Olympics, Feed My Starving Children, Habitat for Humanity and more. She lives in Minneapolis with her husband (who happens to be her best friend), her daughter (who is a small but mighty force of nature) and their puppy (who is, of course, adorable)."
        }
      ]
    },
    {
      "id": "118",
      "title": "SB Banking Panel",
      "day": "wed",
      "time": "9:05am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "119",
      "title": "Digital + Human - Earning Full Share of Wallet at Acquisition and channel optimization",
      "day": "wed",
      "time": "9:45am",
      "description": "This presentation will cover three key areas. First, we'll explore the dynamics of buying behaviors across different customer segments, focusing on how to effectively leverage both physical and digital sales channels.  Second, we'll discuss streamlining our business product offerings to better meet the payment, receivable, and lending needs of our clients. Finally, we'll delve into redefining digital engagement strategies specifically for small and medium-sized businesses.",
      "assets": "",
      "speakers": [
        {
          "fName": "Kamal",
          "lName": "Rajan",
          "photo": "https://www.barlowresearch.com/BusinessBankingConference_2025/images/presenters/Kamal-Rajan.png",
          "title": "Head of Business Services - Products",
          "company": "Golden 1 Credit Union",
          "bio": "Kamal Rajan joined Golden 1 Credit Union in 2024 and now serves as Head of Business Services – Products. Kamal is an accomplished financial services executive and brings over two decades of expertise in small business and business banking, with a proven track record of P&L management, balance sheet optimization, and product development across diverse segments in Commercial Lending, Payments, Treasury Management, Deposits & Cards, Sales, Marketing, and Digital Transformation. Rajan's career includes executive leadership roles at institutions like Wells Fargo, Bank of the West, and U.S. Bank."
        }
      ]
    },
    {
      "id": "120",
      "title": "Break",
      "day": "wed",
      "time": "10:15am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "121",
      "title": "Session",
      "day": "wed",
      "time": "10:30am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "122",
      "title": "Fireside Chat",
      "day": "wed",
      "time": "11:05am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "123",
      "title": "Session",
      "day": "wed",
      "time": "11:35am",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "124",
      "title": "Concluding Remarks + Lunch",
      "day": "wed",
      "time": "12:00pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    },
    {
      "id": "126",
      "title": "Business Banking Alliance: Compass Program - Invite Only",
      "day": "wed",
      "time": "1:00pm",
      "description": "",
      "assets": "",
      "speakers": [
        {
          "fName": "",
          "lName": "",
          "photo": null,
          "title": "",
          "bio": ""
        }
      ]
    }
  ],
  "sponsors": [
    {
      "image": "https://www.barlowresearch.com/BusinessBankingConference_2024/images/sponsor-logos/autobooks-logo.png",
      "url": "https://www.autobooks.co/"
    },
    {
      "image": "https://www.barlowresearch.com/BusinessBankingConference_2024/images/sponsor-logos/DFT_Logo.png",
      "url": "https://www.dragonflyft.com/"
    },
    {
      "image": "https://www.barlowresearch.com/BusinessBankingConference_2024/images/sponsor-logos/IBISWorld.png",
      "url": "https://www.ibisworld.com/"
    },
    {
      "image": "https://www.barlowresearch.com/BusinessBankingConference_2024/images/sponsor-logos/relpro.png",
      "url": "https://relpro.com/"
    },
    {
      "image": "https://www.barlowresearch.com/BusinessBankingConference_2024/images/sponsor-logos/VerticalIQ.png",
      "url": "https://verticaliq.com/"
    }
  ]
}
